---
kind: method
id: M:Autodesk.Revit.DB.PlanTopologySet.Erase(Autodesk.Revit.DB.PlanTopology)
source: html/d42e7aab-b73b-3c85-700e-75e6e6376e97.htm
---
# Autodesk.Revit.DB.PlanTopologySet.Erase Method

Removes a specified object from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	PlanTopology item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.PlanTopology`) - The item to be erased.

## Returns
The number of items that were erased from the set.